; domain
(define (domain transporte)
    (:predicates (aeropuerto ?r)  (en ?c ?r)  (avion ?a)  (carga ?c)  (dentro ?c ?a))
    (:action cargar
        :parameters (?a ?c ?r)
        :precondition (and (en ?c ?r) (en ?a ?r) (carga ?c) (avion ?a) (aeropuerto ?r))
        :effect (and (not (en ?c ?r)) (dentro ?c ?a))
    )
     (:action descargar
        :parameters (?a ?c ?r)
        :precondition (and (dentro ?c ?a) (en ?a ?r) (carga ?c) (avion ?a) (aeropuerto ?r))
        :effect (and (en ?c ?r) (not (dentro ?c ?a)))
    )
     (:action volar
        :parameters (?a ?origen ?destino)
        :precondition (and (en ?a ?origen) (avion ?a) (aeropuerto ?origen) (aeropuerto ?destino))
        :effect (and (not (en ?a ?origen)) (en ?a ?destino))
    )
)

; problem
(define (problem transporte-mad-bcn)
    (:domain transporte)
    (:objects a1 a2 bcn c1 c2 mad)
    (:init (aeropuerto bcn) (aeropuerto mad) (en a1 mad) (en a2 bcn) (en c1 mad) (en c2 bcn) (avion a1) (avion a2) (carga c1) (carga c2))
    (:goal (and (en c1 bcn) (en c2 mad)))
)

; plan
1. (cargar a1 c1 mad)
   deleted: (en c1 mad)
   added: (dentro c1 a1)
   goals met: 0 of 2
2. (cargar a2 c2 bcn)
   deleted: (en c2 bcn)
   added: (dentro c2 a2)
   goals met: 0 of 2
3. (volar a1 mad bcn)
   deleted: (en a1 mad)
   added: (en a1 bcn)
   goals met: 0 of 2
4. (descargar a1 c1 bcn)
   deleted: (dentro c1 a1)
   added: (en c1 bcn)
   goals met: 1 of 2
5. (volar a2 bcn mad)
   deleted: (en a2 bcn)
   added: (en a2 mad)
   goals met: 1 of 2
6. (descargar a2 c2 mad)
   deleted: (dentro c2 a2)
   added: (en c2 mad)
   goals met: 2 of 2
